# Вводится последовательность чисел,
# которая оканчивается нулём.
#
# Реализуйте функцию,
# которая принимает в качестве аргумента каждое число,
# переворачивает его и выводит на экран.

# Пример:
# Введите число: 1234
# Число наоборот: 4321
#
# Введите число: 1000
# Число наоборот: 0001
#
# Введите число: 0
# Программа завершена!
#
# Дополнительно: добейтесь такого вывода чисел, если в его начале идут нули.
#
# Введите число: 1230
# Число наоборот: 321
#
# Кстати, нули, которые мы убрали, называются ведущими.

some_num = input('Введите число: ')


def reverse():
    row = ''
    for n in some_num:
        if n == '0':
            continue
        else:
            row = n + row
    print(row)


while some_num != '0':
    reverse()
    some_num = input('Введите число: ')

print('Программа завершена!')

